//------------------------------------------------------------------------
//                      년 자동입력
//------------------------------------------------------------------------
function insertYear(key, minDate){
    parseInt(minDate, 10);
    var date = new Date();
    var year = date.getFullYear();
    for(var i = year; i >= minDate; i-- ){
        key.append("<option value='" +i+ "'>" + i + "</option>");
    }

}


//------------------------------------------------------------------------
//                      월 자동입력
//------------------------------------------------------------------------
function insertMonth(key){
    for(var i = 1; i <= 12; i++ ){
        key.append("<option value='" +i+ "'>" + i)
    }
}


//------------------------------------------------------------------------
//                      일 자동입력
//------------------------------------------------------------------------
function insertDate(key){
    for(var i = 1; i <= 31; i++ ){
        key.append("<option value='" +i+ "'>" + i)
    }
}

